# A=int(input())
# B=int(input())

# #300 + 385-300
# #A*(((B//100)*100) + (B-((B//100)*100))//10)

# print((B//100)) #3
# print((B-((B//100)*100))//10) #8
# print(B - (((B//100)*100) + (((B-((B//100)*100))//10)*10)) ) #5

# b1 = (B//100)
# b2 = (B-((B//100)*100))//10
# b3 = B - (((B//100)*100) + (((B-((B//100)*100))//10)*10))

# n3 = A * b3
# n4 = A * b2
# n5 = A * b1

# print( b1, b2, b3 , n3, n4, n5)

# print (n3)
# print (n4)
# print (n5)
# print(A*B)

#---------------

A=int(input())
B=int(input())

b1 = (B//100)
b2 = (B-((B//100)*100))//10
b3 = B - (((B//100)*100) + (((B-((B//100)*100))//10)*10))

n3 = A * b3
n4 = A * b2
n5 = A * b1

print (n3)
print (n4)
print (n5)
print(A*B)

'''
음.. //보다 %도 활용했으면 더 간단했을 것 그치만 몰랑 ㅋ
'''